NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.c
/*
 * Copyright 2025, NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXN236
package_id: MCXN236VDF
mcu_data: ksdk2_0
processor_version: 25.03.10
external_user_signals: {}
pin_labels:
- {pin_num: T8, pin_signal: PIO4_15/WUU0_IN21/TRIG_OUT4/USB1_VBUS_DIG/CT4_MAT3/FLEXIO0_D23/CAN1_RXD/ADC0_A1/CMP0_IN4P, label: VMON_12V_SSD6_DIV, identifier: VMON_12V_SSD6_DIV}
- {pin_num: T10, pin_signal: PIO4_20/TRIG_IN8/FC2_P4/CT2_MAT0/FLEXIO0_D28/ADC1_A6, label: V_SSD4_DIS, identifier: V_SSD4_DIS}
- {pin_num: P1, pin_signal: PIO4_0/WUU0_IN18/TRIG_IN6/FC2_P0/CT_INP16/SMARTDMA_PIO24/ADC0_A0, label: UART RX}
- {pin_num: P2, pin_signal: PIO4_1/TRIG_IN7/FC2_P1/CT_INP17/SMARTDMA_PIO25/ADC0_B0, label: UART TX}
- {pin_num: B10, pin_signal: PIO0_16/WUU0_IN2/FC0_P0/CT0_MAT0/UTICK_CAP2/FLEXIO0_D0/PDM0_CLK/I3C0_SDA/ADC0_A8, label: SMB01_SDA, identifier: SMB01_SDA}
- {pin_num: A10, pin_signal: PIO0_17/FC0_P1/CT0_MAT1/UTICK_CAP3/FLEXIO0_D1/PDM0_DATA0/I3C0_SCL/ADC0_A9, label: SMB01_SCL, identifier: SMB01_SCL}
- {pin_num: E4, pin_signal: PIO1_15/WUU0_IN13/FC3_P3/CT_INP11/FLEXIO0_D23/SMARTDMA_PIO11/I3C1_PUR/ADC1_A15, label: SSD6_PWRDIS, identifier: SSD6_PWRDIS}
- {pin_num: F4, pin_signal: PIO1_17/FC5_P1/FC3_P5/CT_INP13/FLEXIO0_D25/SMARTDMA_PIO13/I3C1_SCL/ADC1_A17, label: SSD1_PRSNT_L, identifier: SSD1_PRSNT_L}
- {pin_num: F6, pin_signal: PIO1_16/WUU0_IN14/FC5_P0/FC3_P4/CT_INP12/FLEXIO0_D24/SMARTDMA_PIO12/I3C1_SDA/ADC1_A16, label: SSD0_PRSNT_L, identifier: SSD0_PRSNT_L}
- {pin_num: B1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/FLEXIO0_D17/SMARTDMA_PIO5/I3C1_SCL/ADC1_A9, label: VPP_CPU1_SCL, identifier: VPP_CPU1_SCL}
- {pin_num: A1, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/FLEXIO0_D16/SMARTDMA_PIO4/I3C1_SDA/ADC1_A8, label: VPP_CPU1_SDA, identifier: VPP_CPU1_SDA}
- {pin_num: D3, pin_signal: PIO1_11/WUU0_IN11/TRACE_DATA3/FC4_P3/CT2_MAT1/FLEXIO0_D19/SMARTDMA_PIO7/I3C1_PUR/CAN0_RXD/ADC1_A11, label: SSD67_PWRBRK, identifier: SSD67_PWRBRK}
- {pin_num: C8, pin_signal: PIO0_20/WUU0_IN4/FC0_P4/FC1_P0/CT_INP0/FLEXIO0_D4/I3C0_SDA/ADC0_A12, label: SSD3_PERST_L, identifier: SSD3_PERST_L}
- {pin_num: A8, pin_signal: PIO0_21/FC0_P5/FC1_P1/CT_INP1/FLEXIO0_D5/I3C0_SCL/ADC0_A13, label: SSD6_PERST_L, identifier: SSD6_PERST_L}
- {pin_num: C6, pin_signal: PIO1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/FC3_P0/FC4_P4/CT_INP4/FLEXIO0_D8/SAI1_TX_BCLK/ADC0_A16/CMP0_IN0, label: VMON_12V_SSD1_DIV, identifier: VMON_12V_SSD1_DIV}
- {pin_num: C5, pin_signal: PIO1_1/TRIG_IN1/FC3_P1/FC4_P5/CT_INP5/FLEXIO0_D9/SAI1_TX_FS/ADC0_A17/CMP1_IN0, label: VMON_12V_SSD2_DIV, identifier: VMON_12V_SSD2_DIV}
- {pin_num: E11, pin_signal: PIO0_14/FC1_P6/FC0_P2/CT_INP2/UTICK_CAP0/FLEXIO0_D6/ADC0_B14, label: SSD0_PERST_L, identifier: SSD0_PERST_L}
- {pin_num: G13, pin_signal: PIO0_15/FC0_P3/CT_INP3/UTICK_CAP1/FLEXIO0_D7/ADC0_B15, label: SSD1_PERST_L, identifier: SSD1_PERST_L}
- {pin_num: C9, pin_signal: PIO0_19/WUU0_IN3/EWM0_OUT_b/FC0_P3/CT0_MAT3/FLEXIO0_D3/HSCMP1_OUT/ADC0_A11, label: SSD2_PERST_L, identifier: SSD2_PERST_L}
- {pin_num: B8, pin_signal: PIO0_22/EWM0_IN/FC0_P6/FC1_P2/CT_INP2/FLEXIO0_D6/I3C0_PUR/ADC0_A14/CMP1_IN2, label: VMON_12V_SSD0_DIV, identifier: VMON_12V_SSD0_DIV}
- {pin_num: B7, pin_signal: PIO0_23/WUU0_IN5/EWM0_OUT_b/FC1_P3/CT_INP3/FLEXIO0_D7/ADC0_A15, label: SSD5_PERST_L, identifier: SSD5_PERST_L}
- {pin_num: A4, pin_signal: PIO1_4/WUU0_IN8/FREQME_CLK_IN0/FC3_P4/FC5_P0/CT1_MAT2/FLEXIO0_D12/SMARTDMA_PIO0/SAI0_TXD1/ADC0_A20/CMP0_IN2, label: VMON_12V_SSD4_DIV,
  identifier: VMON_12V_SSD4_DIV}
- {pin_num: B3, pin_signal: PIO1_5/FREQME_CLK_IN1/FC3_P5/FC5_P1/CT1_MAT3/FLEXIO0_D13/SMARTDMA_PIO1/SAI0_RXD1/ADC0_A21/CMP0_IN3, label: VMON_12V_SSD5_DIV, identifier: VMON_12V_SSD5_DIV}
- {pin_num: C3, pin_signal: PIO1_10/TRACE_DATA2/FC4_P2/FC5_P6/CT2_MAT0/FLEXIO0_D18/SMARTDMA_PIO6/CAN0_TXD/ADC1_A10, label: VPP_CPU1_ALERT, identifier: VPP_CPU1_ALERT}
- {pin_num: G4, pin_signal: PIO1_18/FREQME_CLK_IN0/FC5_P2/FC3_P6/CT3_MAT0/FLEXIO0_D26/SMARTDMA_PIO14/CAN0_TXD/ADC1_A18, label: V_SSD5_DIS, identifier: V_SSD5_DIS}
- {pin_num: G5, pin_signal: PIO1_19/WUU0_IN15/FREQME_CLK_IN1/FC5_P3/CT3_MAT1/FLEXIO0_D27/SMARTDMA_PIO15/CAN0_RXD/ADC1_A19, label: V_SSD6_DIS, identifier: V_SSD6_DIS}
- {pin_num: H2, pin_signal: PIO2_0/TRIG_IN5/PWM1_A3/FLEXIO0_D8/SMARTDMA_PIO20/SAI0_RX_BCLK, label: SSD4_PRSNT_L, identifier: SSD4_PRSNT_L}
- {pin_num: H1, pin_signal: PIO2_1/TRACE_CLK/PWM1_B3/FLEXIO0_D9/SMARTDMA_PIO21/SAI0_RX_FS, label: SSD5_PRSNT_L, identifier: SSD5_PRSNT_L}
- {pin_num: H3, pin_signal: PIO2_2/WUU0_IN16/CLKOUT/PWM1_A2/FLEXIO0_D10/SMARTDMA_PIO22/SAI0_TXD0, label: SSD6_PRSNT_L, identifier: SSD6_PRSNT_L}
- {pin_num: J3, pin_signal: PIO2_3/PWM1_B2/FLEXIO0_D11/SMARTDMA_PIO23/SAI0_RXD0, label: SSD7_PRSNT_L, identifier: SSD7_PRSNT_L}
- {pin_num: K3, pin_signal: PIO2_4/WUU0_IN17/PWM1_A1/FLEXIO0_D12/SMARTDMA_PIO24/SAI0_RXD1, label: CLK_SSD6_EN_N, identifier: CLK_SSD6_EN_N}
- {pin_num: K1, pin_signal: PIO2_5/TRIG_OUT3/PWM1_B1/FLEXIO0_D13/SMARTDMA_PIO25/SAI0_TXD1, label: CLK_SSD7_EN_N, identifier: CLK_SSD7_EN_N}
- {pin_num: K2, pin_signal: PIO2_6/TRIG_IN4/PWM1_A0/FLEXIO0_D14/SMARTDMA_PIO26/SAI0_TX_BCLK, label: CLK_SSD5_EN_N, identifier: CLK_SSD5_EN_N}
- {pin_num: L2, pin_signal: PIO2_7/TRIG_IN5/PWM1_B0/FLEXIO0_D15/SMARTDMA_PIO27/SAI0_TX_FS, label: CLK_SSD4_EN_N, identifier: CLK_SSD4_EN_N}
- {pin_num: M2, pin_signal: PIO2_8/TRACE_DATA0/PWM1_X0/FLEXIO0_D16/SMARTDMA_PIO28/SAI1_TXD0, label: SSD4_LED, identifier: SSD4_LED}
- {pin_num: M1, pin_signal: PIO2_9/TRACE_DATA1/PWM1_X1/FLEXIO0_D17/SMARTDMA_PIO29/SAI1_RXD0, label: SSD5_LED, identifier: SSD5_LED}
- {pin_num: M3, pin_signal: PIO2_10/TRACE_DATA2/PWM1_X2/FLEXIO0_D18/SMARTDMA_PIO31/SAI1_RXD1, label: SSD6_LED, identifier: SSD6_LED}
- {pin_num: N4, pin_signal: PIO2_11/TRACE_DATA3/PWM1_X3/FLEXIO0_D19/SMARTDMA_PIO30/SAI1_TXD1, label: SSD7_LED, identifier: SSD7_LED}
- {pin_num: B17, pin_signal: PIO3_0/WUU0_IN22/TRIG_IN0/FC7_P3/CT_INP16/PWM0_A0/FLEXIO0_D8/SMARTDMA_PIO0, label: SSD0_PWRDIS, identifier: SSD0_PWRDIS}
- {pin_num: C15, pin_signal: PIO3_1/TRIG_IN1/FC6_P0/FC7_P6/CT_INP17/PWM0_B0/FLEXIO0_D9/SMARTDMA_PIO1/FREQME_CLK_OUT0, label: SSD1_PWRDIS, identifier: SSD1_PWRDIS}
- {pin_num: D15, pin_signal: PIO3_2/FC7_P0/CT4_MAT0/PWM0_X0/FLEXIO0_D10/SMARTDMA_PIO2, label: SSD2_PWRDIS, identifier: SSD2_PWRDIS}
- {pin_num: D17, pin_signal: PIO3_6/CLKOUT/FC6_P1/CT4_MAT2/PWM0_A1/FLEXIO0_D14/SMARTDMA_PIO6/SAI1_MCLK/FREQME_CLK_OUT1, label: SSD3_PWRDIS, identifier: SSD3_PWRDIS}
- {pin_num: D14, pin_signal: PIO3_7/FC6_P6/FC7_P1/CT4_MAT3/PWM0_B1/FLEXIO0_D15/SMARTDMA_PIO7/SAI0_MCLK, label: CLK_SSD2_EN_N, identifier: CLK_SSD2_EN_N}
- {pin_num: E14, pin_signal: PIO3_8/WUU0_IN23/FC6_P4/FC7_P0/CT_INP4/PWM0_A2/FLEXIO0_D16/SMARTDMA_PIO8/SAI0_TX_BCLK, label: SSD5_PWRDIS, identifier: SSD5_PWRDIS}
- {pin_num: F15, pin_signal: PIO3_9/FC6_P5/FC7_P2/CT_INP5/PWM0_B2/FLEXIO0_D17/SMARTDMA_PIO9/SAI0_TX_FS, label: SSD3_LED, identifier: SSD3_LED}
- {pin_num: F17, pin_signal: PIO3_10/FC6_P2/FC7_P4/CT1_MAT0/PWM0_A3/FLEXIO0_D18/SMARTDMA_PIO10/SAI0_TXD0, label: CLK_SSD3_EN_N, identifier: CLK_SSD3_EN_N}
- {pin_num: H17, pin_signal: PIO3_14/WUU0_IN25/CT_INP6/PWM1_A1/FLEXIO0_D22/SMARTDMA_PIO14/SAI0_RX_BCLK, label: SSD23_PWRBRK, identifier: SSD23_PWRBRK}
- {pin_num: H15, pin_signal: PIO3_15/CT_INP7/PWM1_B1/FLEXIO0_D23/SMARTDMA_PIO15/SAI0_RX_FS, label: SSD45_PWRBRK, identifier: SSD45_PWRBRK}
- {pin_num: J15, pin_signal: PIO3_16/CT_INP8/PWM1_A2/FLEXIO0_D24/SMARTDMA_PIO16/SAI1_TX_BCLK, label: SSD0_LED, identifier: SSD0_LED}
- {pin_num: K15, pin_signal: PIO3_17/WUU0_IN26/CT_INP9/PWM1_B2/FLEXIO0_D25/SMARTDMA_PIO17/SAI1_TX_FS, label: SSD4_PWRDIS, identifier: SSD4_PWRDIS}
- {pin_num: N10, pin_signal: PIO4_18/CT3_MAT2/FLEXIO0_D26, label: V_SSD2_DIS, identifier: V_SSD2_DIS}
- {pin_num: R10, pin_signal: PIO4_19/TRIG_OUT5/CT3_MAT3/FLEXIO0_D27/ADC0_B1/CMP1_IN4P, label: VMON_12V_SSD7_DIV, identifier: VMON_12V_SSD7_DIV}
- {pin_num: T11, pin_signal: PIO4_21/TRIG_IN9/FC2_P5/CT2_MAT1/FLEXIO0_D29/ADC1_B6, label: SSD2_PRSNT_L, identifier: SSD2_PRSNT_L}
- {pin_num: T12, pin_signal: PIO4_22/CT2_MAT2/FLEXIO0_D30, label: SSD3_PRSNT_L, identifier: SSD3_PRSNT_L}
- {pin_num: U12, pin_signal: PIO4_23/TRIG_OUT5/FC2_P6/CT2_MAT3/FLEXIO0_D31/ADC0_A2/ADC0_B2/ADC1_B3, label: V_SSD7_DIS, identifier: V_SSD7_DIS}
- {pin_num: M17, pin_signal: PIO3_20/WUU0_IN27/TRIG_OUT0/FC6_P0/CT2_MAT2/PWM1_A3/FLEXIO0_D28/SMARTDMA_PIO20/SAI1_TXD0, label: VPP_CPU0_SDA, identifier: VPP_CPU0_SDA}
- {pin_num: L16, pin_signal: PIO3_21/TRIG_OUT1/FC6_P1/CT2_MAT3/PWM1_B3/FLEXIO0_D29/SMARTDMA_PIO21/SAI1_RXD0, label: VPP_CPU0_SCL, identifier: VPP_CPU0_SCL}
- {pin_num: C4, pin_signal: PIO1_2/TRIG_OUT0/FC3_P2/FC4_P6/CT1_MAT0/FLEXIO0_D10/SAI1_TXD0/CAN0_TXD/ADC0_A18, label: SSD7_PERST_L, identifier: SSD7_PERST_L}
- {pin_num: B4, pin_signal: PIO1_3/WUU0_IN7/TRIG_OUT1/FC3_P3/CT1_MAT1/FLEXIO0_D11/SAI1_RXD0/CAN0_RXD/ADC0_A19/CMP0_IN1, label: VMON_12V_SSD3_DIV, identifier: VMON_12V_SSD3_DIV}
- {pin_num: A2, pin_signal: PIO1_7/WUU0_IN9/TRIG_OUT2/FC5_P3/CT_INP7/FLEXIO0_D15/SMARTDMA_PIO3/SAI1_RX_FS/CAN1_RXD/ADC0_A23, label: CLK_SSD0_EN_N, identifier: CLK_SSD0_EN_N}
- {pin_num: D4, pin_signal: PIO1_14/FC4_P6/FC3_P2/CT_INP10/FLEXIO0_D22/SMARTDMA_PIO10/ADC1_A14, label: CLK_SSD1_EN_N, identifier: CLK_SSD1_EN_N}
- {pin_num: F16, pin_signal: PIO3_11/WUU0_IN24/FC6_P3/FC7_P5/CT1_MAT1/PWM0_B3/FLEXIO0_D19/SMARTDMA_PIO11/SAI0_RXD0, label: SSD7_PWRDIS, identifier: SSD7_PWRDIS}
- {pin_num: G16, pin_signal: PIO3_12/FC7_P4/FC6_P4/CT1_MAT2/PWM1_A0/FLEXIO0_D20/SMARTDMA_PIO12/SAI0_RXD1, label: SSD01_PWRBRK, identifier: SSD01_PWRBRK}
- {pin_num: H16, pin_signal: PIO3_13/FC7_P5/FC6_P5/CT1_MAT3/PWM1_B0/FLEXIO0_D21/SMARTDMA_PIO13/SAI0_TXD1, label: VPP_CPU0_ALERT, identifier: VPP_CPU0_ALERT}
- {pin_num: K16, pin_signal: PIO3_18/FC6_P6/CT2_MAT0/PWM1_X0/FLEXIO0_D26/SMARTDMA_PIO18/SAI1_RX_BCLK, label: SSD1_LED, identifier: SSD1_LED}
- {pin_num: M15, pin_signal: PIO3_23/FC6_P3/CT_INP11/PWM1_X3/FLEXIO0_D31/SMARTDMA_PIO23/SAI1_TXD1, label: SSD2_LED, identifier: SSD2_LED}
- {pin_num: U1, pin_signal: PIO4_3/WUU0_IN19/TRIG_IN7/FC2_P3/CT_INP13/SMARTDMA_PIO27/ADC0_B4/ADC1_B4/CMP0_IN5N/CMP1_IN5N, label: V_SSD3_DIS, identifier: V_SSD3_DIS}
- {pin_num: C10, pin_signal: PIO0_18/EWM0_IN/FC0_P2/CT0_MAT2/FLEXIO0_D2/HSCMP0_OUT/PDM0_DATA1/ADC0_A10, label: SSD4_PERST_L, identifier: SSD4_PERST_L}
- {pin_num: K12, pin_signal: PIO5_5/TRIG_IN10/LPTMR0_ALT2/TAMPER3/ADC1_B13, label: CLKSEL_MODE, identifier: CLKSEL_MODE}
- {pin_num: K13, pin_signal: PIO5_6/TRIG_OUT6/LPTMR1_ALT2/TAMPER4/ADC1_B14, label: V_SSD0_DIS, identifier: V_SSD0_DIS}
- {pin_num: L13, pin_signal: PIO5_7/TRIG_IN11/TAMPER5/ADC1_B15, label: V_SSD1_DIS, identifier: V_SSD1_DIS}
- {pin_num: U16, pin_signal: PIO5_0/TRIG_IN10/LPTMR0_ALT2/EXTAL32K/ADC1_B8, label: PCIE_SSD0_PERST_L, identifier: PCIE_SSD0_PERST_L}
- {pin_num: U17, pin_signal: PIO5_1/TRIG_OUT6/LPTMR1_ALT2/XTAL32K/ADC1_B9, label: PCIE_SSD1_PERST_L, identifier: PCIE_SSD1_PERST_L}
- {pin_num: M12, pin_signal: PIO5_4/TRIG_OUT7/SPC_LPREQ/TAMPER2/ADC1_B12, label: PCIE_SSD2_PERST_L, identifier: PCIE_SSD2_PERST_L}
- {pin_num: N11, pin_signal: PIO5_3/TRIG_IN11/RTC_CLKOUT/TAMPER1/ADC1_B11, label: PCIE_SSD3_PERST_L, identifier: PCIE_SSD3_PERST_L}
- {pin_num: M10, pin_signal: PIO5_2/VBAT_WAKEUP_b/SPC_LPREQ/TAMPER0/ADC1_B10, label: PCIE_SSD4_PERST_L, identifier: PCIE_SSD4_PERST_L}
- {pin_num: N8, pin_signal: PIO4_14/CT4_MAT2/FLEXIO0_D22, label: PCIE_SSD5_PERST_L, identifier: PCIE_SSD5_PERST_L}
- {pin_num: R8, pin_signal: PIO4_16/FC2_P2/USB1_OTG_PWR/CT3_MAT0/FLEXIO0_D24/CAN1_TXD/ADC0_A6, label: PCIE_SSD6_PERST_L, identifier: PCIE_SSD6_PERST_L}
- {pin_num: R9, pin_signal: PIO4_17/TRIG_IN9/FC2_P3/USB1_OTG_OC/CT3_MAT1/FLEXIO0_D25/ADC0_B6, label: PCIE_SSD7_PERST_L, identifier: PCIE_SSD7_PERST_L}
- {pin_num: D1, pin_signal: PIO1_13/TRIG_IN3/FC4_P5/FC3_P1/CT2_MAT3/FLEXIO0_D21/SMARTDMA_PIO9/CAN1_TXD/ADC1_A13, label: VPP_CPU1B_SCL, identifier: VPP_CPU1B_SCL}
- {pin_num: D2, pin_signal: PIO1_12/WUU0_IN12/TRACE_CLK/FC4_P4/FC3_P0/CT2_MAT2/FLEXIO0_D20/SMARTDMA_PIO8/CAN1_RXD/ADC1_A12, label: VPP_CPU1B_SDA, identifier: VPP_CPU1B_SDA}
- {pin_num: A6, pin_signal: PIO0_25/FC1_P1/CT0_MAT1/ADC0_B17, label: VPP_CPU0B_SCL, identifier: VPP_CPU0B_SCL}
- {pin_num: B6, pin_signal: PIO0_24/FC1_P0/CT0_MAT0/ADC0_B16, label: VPP_CPU0B_SDA, identifier: VPP_CPU0B_SDA}
- {pin_num: B2, pin_signal: PIO1_6/TRIG_IN2/FC3_P6/FC5_P2/CT_INP6/FLEXIO0_D14/SMARTDMA_PIO2/SAI1_RX_BCLK/CAN1_TXD/ADC0_A22, label: VPP_CPU1B_ALERT, identifier: VPP_CPU1B_ALERT}
- {pin_num: M16, pin_signal: PIO3_22/FC6_P2/CT_INP10/PWM1_X2/FLEXIO0_D30/SMARTDMA_PIO22/SAI1_RXD1, label: VPP_CPU0B_ALERT, identifier: VPP_CPU0B_ALERT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

