NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for GPIO0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
    /* Enables the clock for GPIO2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio2);
    /* Enables the clock for GPIO3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio3);
    /* Enables the clock for GPIO4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio4);
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    gpio_pin_config_t SSD0_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin E11)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_PERST_L_GPIO, BOARD_INITPINS_SSD0_PERST_L_PIN, &SSD0_PERST_L_config);

    gpio_pin_config_t SSD1_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin G13)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_PERST_L_GPIO, BOARD_INITPINS_SSD1_PERST_L_PIN, &SSD1_PERST_L_config);

    gpio_pin_config_t SSD4_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin C10)  */
    GPIO_PinInit(BOARD_INITPINS_SSD4_PERST_L_GPIO, BOARD_INITPINS_SSD4_PERST_L_PIN, &SSD4_PERST_L_config);

    gpio_pin_config_t SSD2_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin C9)  */
    GPIO_PinInit(BOARD_INITPINS_SSD2_PERST_L_GPIO, BOARD_INITPINS_SSD2_PERST_L_PIN, &SSD2_PERST_L_config);

    gpio_pin_config_t SSD3_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin C8)  */
    GPIO_PinInit(BOARD_INITPINS_SSD3_PERST_L_GPIO, BOARD_INITPINS_SSD3_PERST_L_PIN, &SSD3_PERST_L_config);

    gpio_pin_config_t SSD6_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin A8)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_PERST_L_GPIO, BOARD_INITPINS_SSD6_PERST_L_PIN, &SSD6_PERST_L_config);

    gpio_pin_config_t SSD5_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin B7)  */
    GPIO_PinInit(BOARD_INITPINS_SSD5_PERST_L_GPIO, BOARD_INITPINS_SSD5_PERST_L_PIN, &SSD5_PERST_L_config);

    gpio_pin_config_t SSD7_PERST_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin C4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD7_PERST_L_GPIO, BOARD_INITPINS_SSD7_PERST_L_PIN, &SSD7_PERST_L_config);

    gpio_pin_config_t VPP_CPU1B_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin B2)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO, BOARD_INITPINS_VPP_CPU1B_ALERT_PIN, &VPP_CPU1B_ALERT_config);

    gpio_pin_config_t CLK_SSD0_EN_N_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin A2)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD0_EN_N_GPIO, BOARD_INITPINS_CLK_SSD0_EN_N_PIN, &CLK_SSD0_EN_N_config);

    gpio_pin_config_t VPP_CPU1_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin C3)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU1_ALERT_GPIO, BOARD_INITPINS_VPP_CPU1_ALERT_PIN, &VPP_CPU1_ALERT_config);

    gpio_pin_config_t CLK_SSD1_EN_N_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin D4)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD1_EN_N_GPIO, BOARD_INITPINS_CLK_SSD1_EN_N_PIN, &CLK_SSD1_EN_N_config);

    gpio_pin_config_t SSD6_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_15 (pin E4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_PWRDIS_GPIO, BOARD_INITPINS_SSD6_PWRDIS_PIN, &SSD6_PWRDIS_config);

    gpio_pin_config_t SSD0_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin F6)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_PRSNT_L_GPIO, BOARD_INITPINS_SSD0_PRSNT_L_PIN, &SSD0_PRSNT_L_config);

    gpio_pin_config_t SSD1_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin F4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_PRSNT_L_GPIO, BOARD_INITPINS_SSD1_PRSNT_L_PIN, &SSD1_PRSNT_L_config);

    gpio_pin_config_t V_SSD5_DIS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin G4)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD5_DIS_GPIO, BOARD_INITPINS_V_SSD5_DIS_PIN, &V_SSD5_DIS_config);

