NVIDIA/OpenSMA/src/boards/p3957/board/pin_mux.c
    gpio_pin_config_t V_SSD0_DIS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_6 (pin K13)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD0_DIS_GPIO, BOARD_INITPINS_V_SSD0_DIS_PIN, &V_SSD0_DIS_config);

    gpio_pin_config_t V_SSD1_DIS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_7 (pin L13)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD1_DIS_GPIO, BOARD_INITPINS_V_SSD1_DIS_PIN, &V_SSD1_DIS_config);

    GPIO1->ICR[16] = ((GPIO1->ICR[16] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO1_16 (pin F6): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD0_PRSNT_L_GPIO, BOARD_INITPINS_SSD0_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO1->ICR[17] = ((GPIO1->ICR[17] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO1_17 (pin F4): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD1_PRSNT_L_GPIO, BOARD_INITPINS_SSD1_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO2->ICR[0] = ((GPIO2->ICR[0] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO2_0 (pin H2): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD4_PRSNT_L_GPIO, BOARD_INITPINS_SSD4_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO2->ICR[1] = ((GPIO2->ICR[1] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO2_1 (pin H1): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD5_PRSNT_L_GPIO, BOARD_INITPINS_SSD5_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO2->ICR[2] = ((GPIO2->ICR[2] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO2_2 (pin H3): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD6_PRSNT_L_GPIO, BOARD_INITPINS_SSD6_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO2->ICR[3] = ((GPIO2->ICR[3] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO2_3 (pin J3): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD7_PRSNT_L_GPIO, BOARD_INITPINS_SSD7_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    GPIO4->ICR[21] = ((GPIO4->ICR[21] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    /* Interrupt configuration on GPIO4_21 (pin T11): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD2_PRSNT_L_GPIO, BOARD_INITPINS_SSD2_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    /* Interrupt configuration on GPIO4_22 (pin T12): Interrupt on either edge */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_SSD3_PRSNT_L_GPIO, BOARD_INITPINS_SSD3_PRSNT_L_PIN, kGPIO_InterruptEitherEdge);

    /* Interrupt configuration on GPIO5_0 (pin U16): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_PCIE_SSD0_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD0_PERST_L_PIN, kGPIO_InterruptStatusFlagDisabled);

    /* Interrupt configuration on GPIO5_1 (pin U17): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_PCIE_SSD1_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD1_PERST_L_PIN, kGPIO_InterruptStatusFlagDisabled);

    /* Interrupt configuration on GPIO5_4 (pin M12): Interrupt/DMA request is disabled */
    GPIO_SetPinInterruptConfig(BOARD_INITPINS_PCIE_SSD2_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD2_PERST_L_PIN, kGPIO_InterruptStatusFlagDisabled);

    /* PORT0_14 (pin E11) is configured as PIO0_14 */
    PORT_SetPinMux(BOARD_INITPINS_SSD0_PERST_L_PORT, BOARD_INITPINS_SSD0_PERST_L_PIN, kPORT_MuxAlt0);

    PORT0->PCR[14] = ((PORT0->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_15 (pin G13) is configured as PIO0_15 */
    PORT_SetPinMux(BOARD_INITPINS_SSD1_PERST_L_PORT, BOARD_INITPINS_SSD1_PERST_L_PIN, kPORT_MuxAlt0);

    PORT0->PCR[15] = ((PORT0->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_16 (pin B10) is configured as FC0_P0 */
    PORT_SetPinMux(BOARD_INITPINS_SMB01_SDA_PORT, BOARD_INITPINS_SMB01_SDA_PIN, kPORT_MuxAlt2);

    PORT0->PCR[16] = ((PORT0->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_17 (pin A10) is configured as FC0_P1 */
    PORT_SetPinMux(BOARD_INITPINS_SMB01_SCL_PORT, BOARD_INITPINS_SMB01_SCL_PIN, kPORT_MuxAlt2);

